In [1]:
import json

#Load the data
def load_data(filename):
    with open(filename,"r")as f:
        data = json.load(f)

        return data

In [2]:
data = load_data("amazon_store_data.json")
print(data)
print(type(data))

[{'name': 'Alice', 'rating': '5 ', 'feedback': 'Great product!!', 'age': '25'}, {'name': 'Bob', 'rating': 'four', 'feedback': 'ok but late Delivery', 'age': '30'}, {'name': ' Charlie', 'rating': 'two', 'feedback': 'BAD EXPERIENCE '}, {'name': 'Diana', 'feedback': 'Loved it!', 'rating': '5', 'age': '28'}, {'name': 'Eve', 'rating': '3.5', 'feedback': 'Average - could be better', 'age': '20'}, {'name': 'Alice', 'rating': '5', 'feedback': 'Great product again!', 'age': '25'}]
<class 'list'>

In [37]:
def clean_data(data):
 for user in data:
   print(user)

In [38]:
clean_data(data)

{'name': 'Alice', 'rating': 5, 'feedback': 'Great product!!', 'age': '25'}
{'name': 'Bob', 'rating': 4, 'feedback': 'ok but late Delivery', 'age': '30'}
{'name': ' Charlie', 'rating': 2, 'feedback': 'BAD EXPERIENCE '}
{'name': 'Diana', 'feedback': 'Loved it!', 'rating': 5, 'age': '28'}
{'name': 'Eve', 'rating': '3.5', 'feedback': 'Average - could be better', 'age': '20'}
{'name': 'Alice', 'rating': 5, 'feedback': 'Great product again!', 'age': '25'}

In [63]:
def clean_data(data):
    text_to_num = {"one": 1, "two": 2, "three": 3, "four": 4, "five": 5}
    cleaned_data = []
    unique_users = set()

    for user in data:
        # Clean rating
        raw_rating = str(user["rating"]).strip().lower()
        if raw_rating in text_to_num:
            raw_rating = text_to_num[raw_rating]
        user["rating"] = raw_rating

        # Handle missing age
        raw_age = user.get("age")
        if raw_age is None:
            user["age"] = None

        # Deduplication
        name = user["name"].strip()
        if name in unique_users:
            continue

        unique_users.add(name)
        cleaned_data.append(user)
    print(unique_users)
    return cleaned_data

In [ ]:
data = clean_data(data)

In [77]:
def get_insight(data):
    #avg rating

    tot_rating = 0
    for user in data:
        tot_rating += float(user["rating"])
    print(f"avg rating = {tot_rating/len(data)}")

    # Percentage of users with poor rating
    poor_rating = 0

    for user in data:
        if(float(user["rating"]) < 3):
            poor_rating += 1
    print(f"% if user with poor rating = {poor_rating/len(data)*100}%")

In [78]:
get_insight(data)

avg rating = 4.083333333333333
% if user with poor rating = 16.666666666666664%

In [79]:
def get_recommedations(data):
    recommendations = []

    for user in data:
        curr_recom = {}
        curr_recom["name"] = user["name"]

        if(float(user["rating"]) >= 4):
          curr_recom["brand"] = "Apple"
        else:
          curr_recom["brand"]  = "Samsung"
    
        recommendations.append(curr_recom)

    return recommendations

In [ ]:
get_recommedations(data)

In [2]:
import pandas as pd

In [3]:
# Pandas
info = {
    "Name":["Sakshi","Khushi","Rishabh"],
    "CGPA":[9.5,8.5,7.5]
}

df = pd.DataFrame(info)
print(df)

      Name  CGPA
0   Sakshi   9.5
1   Khushi   8.5
2  Rishabh   7.5

In [4]:
s = pd.Series([21,20,25,17], index=["Rishabh","Khushi","Sakshi","Bhavesh"])
print(s)
print(s["Khushi"])
print(s["Rishabh"])
print(s["Sakshi"])
print(s["Bhavesh"])

Rishabh    21
Khushi     20
Sakshi     25
Bhavesh    17
dtype: int64
20
21
25
17

In [5]:
s = pd.Series([1,2,3,4,5])
print(s)
print(s[4])

s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,11,12,13,14])

print(s1+s2)

s1[0] = 100
print(s1)

changed_s1 = s1.drop(0)
print(changed_s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64
5
0    11
1    13
2    15
3    17
4    19
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Csv Data

df = pd.read_csv("employee_data.csv")
print(df , type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [7]:
# Json Data

df = pd.read_json("employee_data.json")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [8]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [ ]:
# df.head()
# df.tail()
# df.sample()
# df.info()
# df.shape
# df.describe()
# df.columns
# df.nunique()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [11]:
df = pd.read_csv("globalAirQuality.csv")
print(df)

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
1      2025-11-04 19:25:17.554219      US  New York    40.713    -74.006
2      2025-11-04 20:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
4      2025-11-04 22:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542
17998  2025-11-19 16:25:17.554219      CH    Zurich    47.377      8.542
17999  2025-11-19 17:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
1      32.083   63.043  36.120  4.021  43.536  1.075   90        5.838
2      42.250   82.553  26.935  9.538  23.320  0.977   84       31.833
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
4      21.083   66.423  38.997  6.919  45.615  1.085   97       13.632
...       ...      ...     ...    ...     ...    ...  ...          ...
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951
17998  40.722   95.152  32.957  5.524  53.193  0.868   95       24.042
17999  25.830   30.411  35.317  4.336  66.246  0.848   88        8.529

       humidity  wind_speed
0        70.168       3.725
1        80.088       8.969
2        62.783       9.650
3        89.153       8.956
4        76.499       4.017
...         ...         ...
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660
17998    31.880       2.642
17999    59.104       4.403

[18000 rows x 15 columns]

In [12]:
df
df.head()
df.tail()
df.nunique()

timestamp        360
country           38
city              50
latitude          50
longitude         50
pm25           15839
pm10           16332
no2            15139
so2             8158
o3             15275
co              1376
aqi              178
temperature    13930
humidity       15725
wind_speed      8058
dtype: int64

In [15]:
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [30]:
#Selecting Data

#Select columns
df["country"]
df[["city","aqi"]]

# Select rows (by label)
df.loc[0]
df.loc[0:3]

# Select rows (by index)
df.iloc[0]
df.iloc[4:7]

# Select rows & columns
df.loc[0,"country"]
df.iloc[0,2]

df.iloc[0,1:5]
df.loc[0,["country","aqi"]]

df.loc[0:5, ["country","city","latitude"]]
df.iloc[0:5, 1:3]

# Select single scalar value
df.at[0,"city"]
df.iat[0,2]

'New York'

In [38]:
# Filtering Data
df[df["aqi"] > 100]
df[df["aqi"] > 100][["city","aqi"]]

df[(df["aqi"] > 100) & (df["temperature"] > 30)][["city","aqi"]]

# queru

aqi_val = 100
df.query("aqi > 100 & temperature > 30")[["city","aqi"]]
aqidata = df.query("aqi>@aqi_val & temperature > 30")[["city","aqi"]].copy()

aqidata

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [3]:
import pandas as pd
# Cleaning Data

df = pd.read_csv("raw_data.csv")

# Handle Missing Values
df.isnull() #True for null Values (NaN)
df.isnull().sum() # Counts missing vals per column

df.dropna() # drops rows with missing values
df.dropna(axis = 1) # drops cols with values

df.fillna(0) # fills NaN with value
# df["age"] = df["age"].fillna(df["age"].mean())

# df.ffill() # forward fill
# df.bfill()

cleaned_data = df.copy()
age_mean = cleaned_data["age"].mean()
cleaned_data["age"] = cleaned_data["age"].fillna(age_mean)

cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [4]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [4]:
# Handle Dublicate values
df = pd.read_csv("raw_data.csv")

df.duplicated()
df.duplicated("country")
df.duplicated(["country","gender"])

df2 = df.copy()
df2.drop_duplicates() #drop duplicate rows

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [5]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [6]:
aqi_data = pd.read_csv("globalAirQuality.csv")
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
aqi_data["timestamp"].dtypes
aqi_data

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [7]:
date_str = pd.Series([pd.to_datetime("2026-1-25")])
type(date_str.dtypes)

numpy.dtypes.DateTime64DType

In [8]:
# Handle Data Types
df = pd.read_csv("raw_data.csv")

# String type
df["gender"].str.lower()
df["gender"].str.upper()
df["gender"].str.capitalize()

df["gender"].str.capitalize()
df["name"].str.split(" ")
type(df["name"].str.split(" ")[0])

list

In [9]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [10]:
# Transformation / Feature Engineering
df2 = df.copy()

# apply a fnx to a row or col
df2["tax"] = df2["income"].apply(lambda x : "10%" if x < 60000 else "20%")

# map values to another
new_gender_vals = {"Male":"M", "Feamle":"F","Unknown":"U"}
df2["gender"] = df2["gender"].map(new_gender_vals)

# assign some new values
df2.assign(new_income = df2["income"] * 1.1)

# replace specific values
df2["country"].replace("USA", "United States of America")

0     United States of America
1     United States of America
2                       Canada
3     United States of America
4                        Spain
5                        China
6                        India
7                          NaN
8     United States of America
9                       Mexico
10    United States of America
Name: country, dtype: object

In [11]:
# Transformation / Feature Engineering
df2 = df.copy()

# apply a fnx to a row or col
df2["tax"] = df2["income"].apply(lambda x : "10%" if x < 60000 else "20%")

# map values to another
new_gender_vals = {"Male": "M", "Female": "F", "Unknown": "U"}
df2["gender"] = df2["gender"].map(new_gender_vals)

# assign some new values
df2.assign(new_income = df2["income"] * 1.1)

# replace specific values
df3 = df2.copy()
data = df3["country"].replace("USA", "United States of America")

In [12]:
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  10%
1    1      John Doe  29.0     USA      M  55000.0  10%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  20%
5    5        Li Wei  27.0   China      M  51000.0  10%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%

In [13]:
data

0     United States of America
1     United States of America
2                       Canada
3     United States of America
4                        Spain
5                        China
6                        India
7                          NaN
8     United States of America
9                       Mexico
10    United States of America
Name: country, dtype: object

In [30]:

# Transfromation - Sorting
df2 = df.copy()

# Renaming
df2.columns = ["Id","Name","Age","Country","Gender","Income"]
df2.rename(columns={"Income":"Salary"})
df2.rename(index={0:"frist"})

# Sorting - values & index
df2.sort_values("Income")
# sort values in ascending 
df2.sort_values("Income",ascending=False)
# Sort Values in descending
df2.sort_values(["Age","Income"])
# sorts for age, if age is same then sorts for income

sorted_df2 = df2.sort_values(["Age","Income"])
sorted_df2.sort_index()

# Reset Index
sorted_df2.reset_index()
sorted_df2.reset_index(drop=True)

# Ranking
df2["Ranking"] = df2["Income"].rank(ascending=False, method="dense")

# Reorder
df2[["Id","Name","Age","Income","Gender","Country","Ranking"]]

    Id          Name   Age   Income   Gender Country  Ranking
0    1      John Doe  29.0  55000.0     Male     USA      5.0
1    1      John Doe  29.0  55000.0     Male     USA      5.0
2    2    Jane Smith   NaN  62000.0   Female  Canada      3.0
3    3          Alex   NaN  47000.0  Unknown     USA      7.0
4    4  Maria Garcia  34.0      NaN   Female   Spain      NaN
5    5        Li Wei  27.0  51000.0     Male   China      6.0
6    6           NaN  45.0  73000.0   Female   India      1.0
7    7    Ahmed Khan  38.0  68000.0     Male     NaN      2.0
8    8    Rachel Lee  29.0  62000.0   Female     USA      3.0
9    9   Carlos Ruiz   NaN  45000.0     Male  Mexico      8.0
10  10   Emily Davis  31.0  58000.0      NaN     USA      4.0

In [17]:
df2

    Id          Name   Age Country   Gender   Income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [31]:
import pandas as pd

df = pd.read_csv("raw_data.csv")
df2 = df.copy()
df2.columns = ["Name","Age","Country","Gender","Income","Id"]
df2

    Name           Age  Country  Gender   Income       Id
0      1      John Doe     29.0     USA     Male  55000.0
1      1      John Doe     29.0     USA     Male  55000.0
2      2    Jane Smith      NaN  Canada   Female  62000.0
3      3          Alex      NaN     USA  Unknown  47000.0
4      4  Maria Garcia     34.0   Spain   Female      NaN
5      5        Li Wei     27.0   China     Male  51000.0
6      6           NaN     45.0   India   Female  73000.0
7      7    Ahmed Khan     38.0     NaN     Male  68000.0
8      8    Rachel Lee     29.0     USA   Female  62000.0
9      9   Carlos Ruiz      NaN  Mexico     Male  45000.0
10    10   Emily Davis     31.0     USA      NaN  58000.0

In [32]:
df2 = df.copy()
new_col_order = [col for col in df2.columns if col != "id"] + ["id"]
print(new_col_order)
df2[new_col_order]

['name', 'age', 'country', 'gender', 'income', 'id']

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [34]:
df2 = df.copy()

df2 = df2.drop_duplicates()
df2 = df2.fillna(0)

df2 = df2.sort_values("income")
df2 = df2.reset_index(drop=True)

df2.to_csv("Sorted_data.csv")

In [35]:
df2

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA        0  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0

In [ ]:
# Grouping & Aggregation
df2 = df.copy()

df2.groupby("country")["income"].mean()
df2.groupby("gender")["income"].mean()

df2.groupby("country")["gender"].count()
df2.groupby("gender")["income"].max()

df2.groupby("country")["income"].max()

df2.groupby("country")["income"].agg(["mean","min","max"])

df2.groupby("country")["income"].aggregate(["mean","min","max"])

df2.groupby("country").agg({
    "age":"mean",
    "income":"mean"
})

df2.groupby("country").agg(
    avg_age=("age","mean"),
    avg_salary=("income","mean")
)

          age   income
country
Canada    NaN  62000.0
China    27.0  51000.0
India    45.0  73000.0
Mexico    NaN  45000.0
Spain    34.0      NaN
USA      29.5  55400.0

In [50]:
# Melt & Pivot
df = pd.DataFrame({
    "country":["USA","USA","India","India"],
    "year":[2020,2021,2020,2021],
    "sales":[100,120,90,110],
    "profit":[20,25,18,22]
})

melted=df.melt(
    id_vars =["country","year"],
    value_vars=["sales","profit"],
    var_name="metric",
    value_name="value (in Lakhs)"
)
print(melted)

melted = df.melt(
    id_vars=["country", "year"],     # columns to keep
    value_vars=["sales", "profit"],  # columns to unpivot
    var_name="metric",               # new column name for variable
    value_name="value (in Lakhs)"    # new column name for value (default is value)
)

print(melted)

original = melted.pivot(
    index=["country", "year"],   # cols that become the NEW row index - can't for just country
    columns="metric",            # col whose unique values will become the cols
    values="value (in Lakhs)"    # col whose values will fill the new df
)

print(original)

  country  year  metric  value (in Lakhs)
0     USA  2020   sales               100
1     USA  2021   sales               120
2   India  2020   sales                90
3   India  2021   sales               110
4     USA  2020  profit                20
5     USA  2021  profit                25
6   India  2020  profit                18
7   India  2021  profit                22
  country  year  metric  value (in Lakhs)
0     USA  2020   sales               100
1     USA  2021   sales               120
2   India  2020   sales                90
3   India  2021   sales               110
4     USA  2020  profit                20
5     USA  2021  profit                25
6   India  2020  profit                18
7   India  2021  profit                22
metric        profit  sales
country year
India   2020      18     90
        2021      22    110
USA     2020      20    100
        2021      25    120

In [57]:
# Concatenation 
df1 = pd.DataFrame({
    "id" : [1,2,3],
    "name":["Adam","Bob","Charlie"]
})

df2 = pd.DataFrame({
    "id":[4,5,6],
    "name":["David","Eva","Frank"]
})

pd.concat([df1,df2])
pd.concat([df1,df2], axis=1)
pd.concat([df1,df2], ignore_index=True)

   id     name
0   1     Adam
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva
5   6    Frank

In [52]:
# import & Load Data
import pandas as pd

df = pd.read_csv("emplyee_datapra.csv")
df

# understand the Data
df.head()
df.info()
df.describe()

# handle Missing Values
df.isnull().sum()

# Salary Missing hai - department average
df["salary"] = df.groupby("department")["salary"].transform(
    lambda x: x.fillna(x.mean())
)

# Feature Engineering

df["bonus_rate"] = df["performance"].apply(lambda x:0.20 if x == "Excellent" else(0.10 if x == "Good" else 0.05))

df["bonus_amount"] = df["salary"] * df["bonus_rate"]

# Department - wise Analysis
dept_summary = df.groupby("department").agg({
    "salary" : "mean",
    "bonus_amount": "mean",
    "emp_id" : "count"
})
dept_summary

# Date Feature Extraction

df["joining_date"] = pd.to_datetime(df["joining_date"])
df["joining_year"] = df["joining_date"].dt.year

# Top perfromers
top_paed = df.sort_values("salary",ascending=False).head(3)

df.to_csv("cleaned_emplayee_data.csv",index=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   emp_id        6 non-null      int64
 1   name          6 non-null      object
 2   department    6 non-null      object
 3   experience    6 non-null      int64
 4   salary        5 non-null      float64
 5   performance   6 non-null      object
 6   joining_date  6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [51]:
df

,emp_id,name,department,experience,salary,performance,joining_date,bonus_rate,bonus_amount,joining_year
0,101,Amit,IT,5,60000.0,Excellent,2019-06-15,0.20,12000.0,2019
1,102,Riya,HR,3,45000.0,Good,2021-03-10,0.10,4500.0,2021
2,103,Rahul,IT,7,60000.0,Excellent,2018-01-20,0.20,12000.0,2018
3,104,Pooja,Sales,2,30000.0,Average,2022-07-05,0.05,1500.0,2022
4,105,Ankit,Sales,4,38000.0,Good,2020-11-11,0.10,3800.0,2020
5,106,Neha,HR,6,52000.0,Excellent,2017-09-30,0.20,10400.0,2017

In [35]:
dept_summary

             salary  bonus_amount  emp_id
department
HR          48500.0        7450.0       2
IT          60000.0       12000.0       2
Sales       34000.0        2650.0       2

In [ ]:
top_paed

,emp_id,name,department,experience,salary,performance,joining_date,bonus_rate,bonus_amount,joining_year
0,101,Amit,IT,5,60000.0,Excellent,2019-06-15,0.2,12000.0,2019
2,103,Rahul,IT,7,60000.0,Excellent,2018-01-20,0.2,12000.0,2018
5,106,Neha,HR,6,52000.0,Excellent,2017-09-30,0.2,10400.0,2017

: